zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_MSCM.h
/*! @name IRCP2IGR2 - Interrupt Router CP2 Interrupt Generation */
/*! @{ */

#define MSCM_IRCP2IGR2_INT_EN_MASK               (0x1U)
#define MSCM_IRCP2IGR2_INT_EN_SHIFT              (0U)
#define MSCM_IRCP2IGR2_INT_EN_WIDTH              (1U)
#define MSCM_IRCP2IGR2_INT_EN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_IRCP2IGR2_INT_EN_SHIFT)) & MSCM_IRCP2IGR2_INT_EN_MASK)
/*! @} */

/*! @name IRCP2ISR3 - Interrupt Router CP2 Interrupt Status */
/*! @{ */

#define MSCM_IRCP2ISR3_CP0_INT_MASK              (0x1U)
#define MSCM_IRCP2ISR3_CP0_INT_SHIFT             (0U)
#define MSCM_IRCP2ISR3_CP0_INT_WIDTH             (1U)
#define MSCM_IRCP2ISR3_CP0_INT(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_IRCP2ISR3_CP0_INT_SHIFT)) & MSCM_IRCP2ISR3_CP0_INT_MASK)

#define MSCM_IRCP2ISR3_CP1_INT_MASK              (0x2U)
#define MSCM_IRCP2ISR3_CP1_INT_SHIFT             (1U)
#define MSCM_IRCP2ISR3_CP1_INT_WIDTH             (1U)
#define MSCM_IRCP2ISR3_CP1_INT(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_IRCP2ISR3_CP1_INT_SHIFT)) & MSCM_IRCP2ISR3_CP1_INT_MASK)

#define MSCM_IRCP2ISR3_CP2_INT_MASK              (0x4U)
#define MSCM_IRCP2ISR3_CP2_INT_SHIFT             (2U)
#define MSCM_IRCP2ISR3_CP2_INT_WIDTH             (1U)
#define MSCM_IRCP2ISR3_CP2_INT(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_IRCP2ISR3_CP2_INT_SHIFT)) & MSCM_IRCP2ISR3_CP2_INT_MASK)
/*! @} */

/*! @name IRCP2IGR3 - Interrupt Router CP2 Interrupt Generation */
/*! @{ */

#define MSCM_IRCP2IGR3_INT_EN_MASK               (0x1U)
#define MSCM_IRCP2IGR3_INT_EN_SHIFT              (0U)
#define MSCM_IRCP2IGR3_INT_EN_WIDTH              (1U)
#define MSCM_IRCP2IGR3_INT_EN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_IRCP2IGR3_INT_EN_SHIFT)) & MSCM_IRCP2IGR3_INT_EN_MASK)
/*! @} */

/*! @name IRCPCFG - Interrupt Router Configuration */
/*! @{ */

#define MSCM_IRCPCFG_CP0_TR_MASK                 (0x1U)
#define MSCM_IRCPCFG_CP0_TR_SHIFT                (0U)
#define MSCM_IRCPCFG_CP0_TR_WIDTH                (1U)
#define MSCM_IRCPCFG_CP0_TR(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_CP0_TR_SHIFT)) & MSCM_IRCPCFG_CP0_TR_MASK)

#define MSCM_IRCPCFG_CP1_TR_MASK                 (0x2U)
#define MSCM_IRCPCFG_CP1_TR_SHIFT                (1U)
#define MSCM_IRCPCFG_CP1_TR_WIDTH                (1U)
#define MSCM_IRCPCFG_CP1_TR(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_CP1_TR_SHIFT)) & MSCM_IRCPCFG_CP1_TR_MASK)

#define MSCM_IRCPCFG_CP2_TR_MASK                 (0x4U)
#define MSCM_IRCPCFG_CP2_TR_SHIFT                (2U)
#define MSCM_IRCPCFG_CP2_TR_WIDTH                (1U)
#define MSCM_IRCPCFG_CP2_TR(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_CP2_TR_SHIFT)) & MSCM_IRCPCFG_CP2_TR_MASK)

#define MSCM_IRCPCFG_LOCK_MASK                   (0x80000000U)
#define MSCM_IRCPCFG_LOCK_SHIFT                  (31U)
#define MSCM_IRCPCFG_LOCK_WIDTH                  (1U)
#define MSCM_IRCPCFG_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_LOCK_SHIFT)) & MSCM_IRCPCFG_LOCK_MASK)
/*! @} */

/*! @name XN_CTRL - Memory Execution Control */
/*! @{ */

#define MSCM_XN_CTRL_PRAM0_MASK                  (0x1U)
#define MSCM_XN_CTRL_PRAM0_SHIFT                 (0U)
#define MSCM_XN_CTRL_PRAM0_WIDTH                 (1U)
#define MSCM_XN_CTRL_PRAM0(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_PRAM0_SHIFT)) & MSCM_XN_CTRL_PRAM0_MASK)

#define MSCM_XN_CTRL_PRAM_1_MASK                 (0x2U)
#define MSCM_XN_CTRL_PRAM_1_SHIFT                (1U)
#define MSCM_XN_CTRL_PRAM_1_WIDTH                (1U)
#define MSCM_XN_CTRL_PRAM_1(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_PRAM_1_SHIFT)) & MSCM_XN_CTRL_PRAM_1_MASK)

#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_MASK    (0x100U)
#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_SHIFT   (8U)
#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_WIDTH   (1U)
#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC_MASK    (0x200U)
#define MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC_SHIFT   (9U)
#define MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC_WIDTH   (1U)
#define MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC_MASK    (0x400U)
#define MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC_SHIFT   (10U)
#define MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC_WIDTH   (1U)
#define MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_0_ITCM_MASK             (0x1000U)
#define MSCM_XN_CTRL_CM7_0_ITCM_SHIFT            (12U)
#define MSCM_XN_CTRL_CM7_0_ITCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_0_ITCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_ITCM_SHIFT)) & MSCM_XN_CTRL_CM7_0_ITCM_MASK)

#define MSCM_XN_CTRL_CM7_1_ITCM_MASK             (0x2000U)
#define MSCM_XN_CTRL_CM7_1_ITCM_SHIFT            (13U)
#define MSCM_XN_CTRL_CM7_1_ITCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_1_ITCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_1_ITCM_SHIFT)) & MSCM_XN_CTRL_CM7_1_ITCM_MASK)

#define MSCM_XN_CTRL_CM7_2_ITCM_MASK             (0x4000U)
#define MSCM_XN_CTRL_CM7_2_ITCM_SHIFT            (14U)
#define MSCM_XN_CTRL_CM7_2_ITCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_2_ITCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_2_ITCM_SHIFT)) & MSCM_XN_CTRL_CM7_2_ITCM_MASK)

#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_MASK (0x10000U)
#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_SHIFT (16U)
#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC(x)  (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC_MASK (0x20000U)
#define MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC_SHIFT (17U)
#define MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC(x)  (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC_MASK (0x40000U)
#define MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC_SHIFT (18U)
#define MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC(x)  (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_0_DTCM_MASK             (0x100000U)
#define MSCM_XN_CTRL_CM7_0_DTCM_SHIFT            (20U)
#define MSCM_XN_CTRL_CM7_0_DTCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_0_DTCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_DTCM_SHIFT)) & MSCM_XN_CTRL_CM7_0_DTCM_MASK)

#define MSCM_XN_CTRL_CM7_1_DTCM_MASK             (0x200000U)
#define MSCM_XN_CTRL_CM7_1_DTCM_SHIFT            (21U)
#define MSCM_XN_CTRL_CM7_1_DTCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_1_DTCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_1_DTCM_SHIFT)) & MSCM_XN_CTRL_CM7_1_DTCM_MASK)

